import tensorflow as tf  
  
a=tf.constant([  
        [[1.0,2.0,3.0,4.0],  
        [5.0,6.0,7.0,8.0],  
        [8.0,7.0,6.0,5.0],  
        [4.0,3.0,2.0,1.0]],  
        [[4.0,3.0,2.0,1.0],  
         [8.0,7.0,6.0,5.0],  
         [1.0,2.0,3.0,4.0],  
         [5.0,6.0,7.0,8.0]]  
    ])  
  
a=tf.reshape(a,[1,4,4,2])  
  
pooling=tf.nn.max_pool(a,[1,2,2,1],[1,2,2,1],padding='VALID')  
with tf.Session() as sess:  
    print("image:")  
    image:
# 矩阵形式
# [[[[ 1.  2.]
#    [ 3.  4.]
#    [ 5.  6.]
#    [ 7.  8.]]

#   [[ 8.  7.]
#    [ 6.  5.]
#    [ 4.  3.]
#    [ 2.  1.]]

#   [[ 4.  3.]
#    [ 2.  1.]
#    [ 8.  7.]
#    [ 6.  5.]]

#   [[ 1.  2.]
#    [ 3.  4.]
#    [ 5.  6.]
#    [ 7.  8.]]]]
# 图片形式　4*4*2

# 1 3 5 7
# 8 6 4 2
# 4 2 8 6
# 1 3 5 7

# 2 4 6 8
# 7 5 3 1
# 3 1 7 5
# 2 4 6 8
    image=sess.run(a)  
    print (image)  
    print("reslut:")  
    result=sess.run(pooling)  
    print (result)  
# output 
#  8 7 
#  4 8

#  7 8
#  4 8